Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs.IsSavingAsMasterFile
Indicates whether the document is to be saved as master file.
Since:
2010

Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs.PathName
Target path to which the document is to be saved.
Since:
2010

Autodesk.Revit.DB.Events.DocumentSavingAsEventArgs
The event arguments used by the DocumentSavingAs event.
Since:
2010